In [1]:
import pandas as pd
import numpy as np

In [18]:
ir=pd.read_csv(r"Income.csv")

In [20]:
ir.loc[:,'AGE'].mean()

np.float64(21.2)

In [21]:
ir.loc[:,'INCOME'].mean()

np.float64(35412.1)

In [26]:
ir.loc[:,'AGE'].median()

np.float64(21.0)

In [27]:
ir.loc[:,'INCOME'].median()

np.float64(33163.5)

In [6]:
ir.head()

   CID  AGE  GENDER  INCOME
0  CID  AGE  GENDER  INCOME
1    1   20    Male   42592
2    2   21  Female   22526
3    3   22    Male   46786
4    4   20  Female   34951

In [7]:
ir.tail()

   CID AGE  GENDER INCOME
16  16  22  Female  25410
17  17  20    Male  35743
18  18  20    Male  28415
19  19  21  Female  24369
20  20  22  Female  47268

In [8]:
ir.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 21 entries, 0 to 20
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   CID     21 non-null     object
 1   AGE     21 non-null     object
 2   GENDER  21 non-null     object
 3   INCOME  21 non-null     object
dtypes: object(4)
memory usage: 804.0+ bytes

In [9]:
ir.describe()

        CID AGE GENDER  INCOME
count    21  21     21      21
unique   21   6      3      21
top     CID  20   Male  INCOME
freq      1   7     10       1

In [31]:
ir.loc[:,'AGE'].mode()

0    20
Name: AGE, dtype: int64

In [32]:
ir.loc[:,'INCOME'].mode()

0     22526
1     24369
2     25410
3     25757
4     27027
5     28415
6     28821
7     29709
8     30742
9     31376
10    34951
11    35743
12    42592
13    42736
14    43497
15    43537
16    46786
17    47268
18    47295
19    49685
Name: INCOME, dtype: int64

ir.mean()

In [34]:
ir.min()

CID            1
AGE           20
GENDER    Female
INCOME     22526
dtype: object

In [35]:
ir.max()

CID          20
AGE          24
GENDER     Male
INCOME    49685
dtype: object

ir.loc[:,'AGE'].min(skipna=False)

In [36]:
ir.loc[:,'AGE'].min(skipna=False)

np.int64(20)

In [37]:
ir.loc[:,'AGE'].std()

np.float64(1.1516578439248717)

In [38]:
ir.loc[:,'INCOME'].std()

np.float64(9079.592304202117)